/*
* 摘    要： n个人围成一个圈，顺序编号。从第一个人开始按1、2、3循环报数，报3的退出，则最后剩下的是几号？指针
*/

#include <stdio.h>
void main() {
	int i, m, n, k, num[50], *p = NULL;

	//用户指定人数 n
	do{
		printf("Input number of person(0 ~ 50): n = ");
	    scanf("%d", &n);
	}while (n >= 50 || n<=0);
	
	i = 0; //i为每个人的初始编号
	k = 0; //k为1、2、3报数时的计数变量
	m = n; //m为剩下的人数

	p = num; //指针指向数组的开头
	for (i=0; i<n; i++) {
		*(p+i) = i+1; //给初始编号
	}

	//开始报数，报3的退出。当剩下的人数为1时停止
	i= 0;
	while (m > 1) {
		if (num[i] != -1) k++; //该位置i值不是-1，则报数k自增

		// 如果报数为k=3
		if (3 == k){
			k = 0; //下一个从1开始；这里初始化为1之前的数字0
			num[i] = -1; //该位置值改为-1
			m--; //场上总人数 -1
		}

		i++; //下一个编号
		if (i >= n) i = 0; //如果达到数组上限，则 n-1是最后一个，n就是0
	}
	
	// 看最后一个的值是多少
	while (*p == -1) p++;
	printf("The last one is NO.%d\n\n", *p);
}