/*
* 文件标识：练习   ………失败了，不知道为什么，中间值很乱……继续改进………已经找到问题并改进
* 摘    要：打印杨辉三角的前N行
*/
#include <stdio.h>
#define N 12 //设定要打印的杨辉三角行数
void main()
{
	int a[N+1][N+1], i, j;
	//初始化，使第一列及对角线元素为1
	for (i=1; i<=N; i++)
	{
		a[i][1]=1;
		a[i][i]=1;
	}
	//给其他元素赋值
	for(i=3; i<=N; i++)
		for(j=2; j<=i-1; j++)// i-1 不是N
		/*很无语，打了一堆乱码，不知道是哪里错了，原来在这里
		把 j<=i-1的=漏掉了。写成 j<i 更好,我感觉更精练*/
		{
			a[i][j]=a[i-1][j]+a[i-1][j-1];
		}
	//输出
	for(i=1; i<=N; i++)
	{
		for(j=1; j<=i; j++)//i不是N
		{
			printf("%6d",a[i][j]);
		}
	printf("\n");
	}
}